[{"Benefit":"Additional Study","Archetype":"Gifted","Description":"Learn a Form not normally allowed to your careers.","Old IKRPG Description":"Gain an additional spell from one of your career spell lists. This benefit can be taken multiple times, but you cannot exceed twice your INT in spells known."},{"Benefit":"Ambidextrous","Archetype":"Skilled","Description":"You can use either hand equally well. Does not convey additional attacks.","Old IKRPG Description":"You do not suffer penalties to your attack roll with a second weapon while using Two-Weapon Fighting."},{"Benefit":"Battlefield Coordinator","Archetype":"Intellectual","Description":"Friendly characters do not suffer firing into melee penalties with ranged\/magic and cannot hit friendly characters if they miss.","Old IKRPG Description":"While in his CMD range, friendly characters do not suffer firing into melee penalties with ranged\/magic and cannot hit friendly characters if they miss."},{"Benefit":"Beat Back","Archetype":"Mighty","Description":"When you hit with a melee attack, you may push your target 2m directly away and then advance up to 2m.","Old IKRPG Description":"When you hit with a melee attack, you may push your target 1 directly away and then advance up to 1."},{"Benefit":"Blood Boon","Archetype":"Gifted","Description":"When you destroy a living character with a melee attack, immediately cast a spell.","Old IKRPG Description":"When you destroy a living character with a melee attack, instead of gaining a feat point he can immediately cast a spell with a cost of 3 or lower without spending fury points or generating fatigue. This spell does not require a quick action."},{"Benefit":"Blood Weaving","Archetype":"Gifted","Description":"* As an action, allocate dice from Arcane to an attack made with a Sacral Blade; dice may be allocated to attack, damage, or both.\n* Cast a touch spell on a Sacral Blade. The spell affects the first object struck with the blade.","Old IKRPG Description":""},{"Benefit":"Bone Grinding","Archetype":"Gifted","Description":"* Use the remains of creatures to enchant objects.","Old IKRPG Description":null},{"Benefit":"Cagey","Archetype":"Skilled","Description":"When knocked down, immediately move up to 4m. Stand up without forfeiting movement or action.","Old IKRPG Description":"When knocked down, immediately move up to 2 (no free strikes). You are not auto-hit with melee and do not take DEF penalty. Stand up without forfeiting movement or action."},{"Benefit":"Combat Caster","Archetype":"Gifted","Description":"When you make a magic attack roll, reroll ones.","Old IKRPG Description":"When you make a magic attack roll, gain an additional die. Discard the lowest die of each roll."},{"Benefit":"Deft","Archetype":"Skilled","Description":"Increase maximum Agility by 1D. May only be taken once.","Old IKRPG Description":"You gain boosted AGL rolls."},{"Benefit":"Fast Caster","Archetype":"Gifted","Description":"Take the higher of your Perception or Arcane for Initiative in any turn in which you cast a spell.","Old IKRPG Description":"Gain one extra quick action each activation that can only be used to cast a spell."},{"Benefit":"Feat: Back Swing","Archetype":"Mighty","Description":"All CPs spent to increase attack rolls count for 2 dice each.","Old IKRPG Description":"Once per turn, you can spend a feat point to gain one additional melee attack."},{"Benefit":"Feat: Bounding Leap","Archetype":"Mighty","Description":"Once during each turn if you don't run or charge, spend a CP to place yourself within 10m of your current location.","Old IKRPG Description":"Once during each turn if you don't run or charge, spend a feat point to place yourself within 5 of your current location."},{"Benefit":"Feat: Counter Charge","Archetype":"Mighty","Description":"When an enemy advances and ends movement within 12m and in LOS, spend a CP to move and attack as Reflexives.","Old IKRPG Description":"When an enemy advances and ends movement within 6 and in LOS, spend a feat point to charge."},{"Benefit":"Feat: Defensive Strike","Archetype":"Skilled","Description":"When an enemy advances and ends movement in your melee range, spend a CP to make a melee attack.","Old IKRPG Description":"When an enemy advances and ends movement in your melee range, spend a feat point to make a melee attack."},{"Benefit":"Feat: Disarm","Archetype":"Skilled","Description":"After hitting an enemy with non-spray\/non-AOE ranged\/melee attack, spend a CP to disarm the target.","Old IKRPG Description":"After hitting an enemy with non-spray\/non-AOE ranged\/melee attack, spend a feat point to disarm the target."},{"Benefit":"Feat: Dominator","Archetype":"Gifted","Description":"Spend a CP to double dice on a mind-affecting spell or effect for one round.","Old IKRPG Description":"Spend a feat point during your turn to double your control area for one round."},{"Benefit":"Feat: Flawless Timing","Archetype":"Intellectual","Description":"Spend a CP and name an enemy. Next time that enemy directly hits you, he misses instead.","Old IKRPG Description":"Spend a feat point and name an enemy. Next time that enemy directly hits you, he misses instead."},{"Benefit":"Feat: Invulnerable","Archetype":"Mighty","Description":"All CP spent to soak damage count as 2 dice.","Old IKRPG Description":"Spend a feat point to gain +3 ARM for one round."},{"Benefit":"Feat: Perfect Plot","Archetype":"Intellectual","Description":"Spend a feat point and character's following your plans gain +1D on non-combat rolls for the day.","Old IKRPG Description":"Spend a feat point and character's following your plans gain an additional die on non-combat rolls for the day."},{"Benefit":"Feat: Plan of Action","Archetype":"Intellectual","Description":"At the start of combat, spend a feat point to grant +2D to initiative and +2D to attack rolls during the first round of combat.","Old IKRPG Description":"At the start of combat, spend a feat point to grant +2 to initiative and +2 to attack rolls during the first round of combat."},{"Benefit":"Feat: Powerful Caster","Archetype":"Gifted","Description":"Spend a CP to double the range on a spell or effect for one round.","Old IKRPG Description":"Spend a feat point when you cast a spell to increase the RNG by 2. Does not affect CTRL or SP spells."},{"Benefit":"Feat: Prescient","Archetype":"Intellectual","Description":"Spend a CP to win initiative and take the first turn. If two or more people use this, they make initiative rolls to see which goes first.","Old IKRPG Description":"Spend a feat point to win initiative and take the first turn. If two or more people use this, they make initiative rolls to see which goes first."},{"Benefit":"Feat: Quick Cast","Archetype":"Gifted","Description":"Spend a CP to immediately cast one non-offensive spell at the start of combat. ","Old IKRPG Description":"Spend a feat point to immediately cast one upkeep spell at the start of combat. Do not pay the COST."},{"Benefit":"Feat: Quick Thinking","Archetype":"Intellectual","Description":"Once per round, spend a CP to use one skill as a Reflexive at the start of another character's turn.","Old IKRPG Description":"Once per round, spend a feat point to make one attack or quick action at the start of another character's turn."},{"Benefit":"Feat: Revitalize","Archetype":"Mighty","Description":"Spend a CP to remove two damage levels.","Old IKRPG Description":"Spend a feat point to regain a number of vitality points equal to your PHY."},{"Benefit":"Feat: Shield Breaker","Archetype":"Mighty","Description":"Spend a CP to destroy a shield if you hit with a melee attack.","Old IKRPG Description":"Spend a feat point to destroy a shield if you hit with a melee attack."},{"Benefit":"Feat: Strength of Will","Archetype":"Gifted","Description":"Spend a CP to automatically pass a Willpower check.","Old IKRPG Description":"After a failed fatigue roll, spend a feat point to instead automatically succeed."},{"Benefit":"Feat: Swashbuckler","Archetype":"Skilled","Description":"Spend a CP to treat a full Dodge as a Reflexive.","Old IKRPG Description":"Once during each turn, spend a feat point to gain 360 degree front arc and make melee attack against each target in melee range."},{"Benefit":"Feat: Unconventional Warfare","Archetype":"Intellectual","Description":"Spend a CP to turn the environment against the enemy.","Old IKRPG Description":"Spend a feat point to turn the environment against the enemy."},{"Benefit":"Feat: Untouchable","Archetype":"Skilled","Description":"Every CP spent on Dodge gives +2D.","Old IKRPG Description":"Spend a feat point to gain +3 DEF for one round."},{"Benefit":"Feat: Vendetta","Archetype":"Mighty","Description":"Spend a CP and name an enemy. Gain +1D to attack and damage dice against that enemy for the remainder of the combat.","Old IKRPG Description":"Spend a feat point and name an enemy. Gain boosted attack rolls against that enemy."},{"Benefit":"Focusing","Archetype":"Gifted","Description":"* As an action, allocate dice from Arcane to an attack made by a Warjack under your control; dice may be allocated to attack, damage, or both.\n* As an action, allocate dice from Arcane to a soak roll when wearing Warcaster Armor.\n* As an action, allocate dice from Arcane to an attack made with a Mechanikal weapon; dice may be allocated to attack, damage, or both.","Old IKRPG Description":null},{"Benefit":"Genius","Archetype":"Intellectual","Description":"Increase Intellect skill maximums by +1D. May only be taken once.","Old IKRPG Description":"You gain boosted INT rolls."},{"Benefit":"Harnessing","Archetype":"Gifted","Description":"* As an action, allocate dice from Arcane to an attack made by a Warbeast under your control; dice may be allocated to attack, damage, or both.\n* As an action, allocate dice from Arcane to an attack made with a Magical weapon; dice may be allocated to attack, damage, or both.\n* As an action, make a Difficult Arcane + First Aid roll to transfer a wound level to a Warbeast.","Old IKRPG Description":null},{"Benefit":"Hyper Perception","Archetype":"Intellectual","Description":"Increase Perception skill maximums by +1D. May only be taken once.","Old IKRPG Description":"You gain boosted PER rolls."},{"Benefit":"Ingenuity","Archetype":"Intellectual","Description":"Increase Technical skill maximums by +1D. May only be taken once.","Old IKRPG Description":null},{"Benefit":"Magic Sensitivity","Archetype":"Gifted","Description":"Automatically sense when another character casts a spell within 3m per pip in Arcane. ","Old IKRPG Description":"Automatically sense when another character casts a spell within 50' per point of ARC. Focusers can sense focuses in same detection range."},{"Benefit":"Magus","Archetype":"Gifted","Description":"Increase Arcane skill maximums by +1D. May only be taken once.","Old IKRPG Description":null},{"Benefit":"Photographic Memory","Archetype":"Intellectual","Description":"You have a photographic memory.","Old IKRPG Description":"You have photographic memory."},{"Benefit":"Potent","Archetype":"Mighty","Description":"Increase Strength skill maximums by +1D. May only be taken once.","Old IKRPG Description":null},{"Benefit":"Preternatural Awareness","Archetype":"Skilled","Description":"You gain +1D to Initiative rolls and enemies never gain back strike bonuses.","Old IKRPG Description":"You gain boosted Initiative rolls and enemies never gain back strike bonuses."},{"Benefit":"Righteous Anger","Archetype":"Mighty","Description":"When one or more friendly characters are damaged by an enemy attack, gain +1D Strength for one round.","Old IKRPG Description":"When one or more friendly characters are damaged by an enemy attack while in your CMD range, gain +2 STR and ARM for one round."},{"Benefit":"Rune Caster","Archetype":"Gifted","Description":"* As an action, allocate dice from Arcane to an attack made with a Rune Bullet; dice may be allocated to attack, damage, or both.\n* Cast a touch spell on a rune bullet. The spell affects the first object struck with the bullet.","Old IKRPG Description":null},{"Benefit":"Rune Reader","Archetype":"Gifted","Description":"Identify any spell cast in line of sight. Learn the type of magic cast and tradition of caster.","Old IKRPG Description":"Identify any spell cast in line of sight. Learn the type of magic cast and tradition of caster."},{"Benefit":"Savant","Archetype":"Intellectual","Description":"Can attempt to use skills untrained at a -2D to skill roll.","Old IKRPG Description":"Can attempt to use skills untrained at a -2 to skill roll."},{"Benefit":"Sidestep","Archetype":"Skilled","Description":"When you hit with an enemy with a melee weapon, advance up to 4m.","Old IKRPG Description":"When you hit with an enemy with a melee weapon, advance up to 2. You cannot be targeted by free strikes during this move."},{"Benefit":"Tough","Archetype":"Mighty","Description":"When you are immobilized, roll a D6. On a 5 or 6, remove one wound level. You are no longer immobilized, but you are knocked down.","Old IKRPG Description":"When you are disabled, roll a D6. On a 5 or 6, heal 1 vitality point. You are no longer disabled but you are knocked down."},{"Benefit":"Virtuoso","Archetype":"Skilled","Description":"Choose a military skill. When making a non-AOE attack with a weapon with that skill, reroll ones.","Old IKRPG Description":"Choose a military skill. When making a non-AOE attack with a weapon with that skill, gain die to attack and damage and discard low die."},{"Benefit":"Warding Circle","Archetype":"Gifted","Description":"Spend 15 minutes to create a warded circle.","Old IKRPG Description":"Spend 15 minutes to create a warded circle."},{"Benefit":"Will Weaver","Archetype":"Gifted","Description":"* +1 FP at the time the benefit is taken.\n* Add Arcane to any Willpower roll to resist a spell.\n* As a Reflexive action, make a Willpower roll at (spell difficulty + 10) to counter a spell cast by another caster.","Old IKRPG Description":null}]